I have checked and current release of module is able to create such node groups
![image](https://user-images.githubusercontent.com/20227477/132357617-585ec48e-c638-4e92-aa17-ccd77b598a1b.png)

```
  # module.eks_cluster.module.node_groups.aws_eks_node_group.workers["node2"] will be created
  + resource "aws_eks_node_group" "workers" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "m5.xlarge",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "eksnode2"
      + node_role_arn          = "arn:aws:iam::*******:role/eks20210825103410662700000003"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07a78a7e8184e3702",
        ]
      + tags                   = {
          + "Name" = "eks"
        }
      + tags_all               = {
          + "Name"    = "eks"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 0
          + max_size     = 10
          + min_size     = 0
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }
```